In [2]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [3]:
df_copy = df.copy()

id(df_copy) == id(df)

False

In [8]:
df_table = df_copy.pivot_table(index=['job_title_short', 'job_country'], aggfunc='size')

df_table.head(10)

job_title_short   job_country
Business Analyst  Afghanistan      4
                  Albania         11
                  Algeria         21
                  Angola           1
                  Argentina      453
                  Armenia         29
                  Australia      928
                  Austria        738
                  Azerbaijan      16
                  Bahamas          5
dtype: int64

In [9]:
df_alt = df.copy()
id(df_alt) == id(df)

False

In [11]:
pv_table = df_alt.pivot_table(values='salary_year_avg', index='company_name', aggfunc=['max', 'min', 'mean'])

pv_table.head(5)

                                    max             min            mean
                        salary_year_avg salary_year_avg salary_year_avg
company_name
#twiceasnice Recruiting   120000.000000    61000.000000    77750.000000
/dev/color                125000.000000   125000.000000   125000.000000
0nward Select              92500.000000    92500.000000    92500.000000
1 Point System            137290.484375   137290.484375   137290.484375
1 Point System LLC.       170000.000000   170000.000000   170000.000000

In [12]:
df_pv = df.copy()
id(df_pv) == id(df)

False

In [24]:
df_filtered = df_pv[df_pv['job_title_short'] == 'Data Scientist'].copy()
piviot_table = df_filtered.pivot_table(values='salary_year_avg', index=['company_name', 'job_country'], aggfunc= 'median')
alt_piviot_table = piviot_table[piviot_table['salary_year_avg'] > 200000]

alt_piviot_table.head(10)

                                 salary_year_avg
company_name      job_country
84.51             United States         225000.0
84.51°            United States         221875.0
ACT               Sudan                 225000.0
                  United States         225000.0
ANSER Corporation United States         225000.0
AT&T              Sudan                 212000.0
                  United States         214379.5
Abbott            United States         204000.0
Airbnb            United States         213750.0
Airtable          Sudan                 215500.0